<#
#̷𝓍   𝓐𝓡𝓢 𝓢𝓒𝓡𝓘𝓟𝓣𝓤𝓜
#̷𝓍   🇵​​​​​🇴​​​​​🇼​​​​​🇪​​​​​🇷​​​​​🇸​​​​​🇭​​​​​🇪​​​​​🇱​​​​​🇱​​​​​ 🇸​​​​​🇨​​​​​🇷​​​​​🇮​​​​​🇵​​​​​🇹​​​​​ 🇧​​​​​🇾​​​​​ 🇬​​​​​🇺​​​​​🇮​​​​​🇱​​​​​🇱​​​​​🇦​​​​​🇺​​​​​🇲​​​​​🇪​​​​​🇵​​​​​🇱​​​​​🇦​​​​​🇳​​​​​🇹​​​​​🇪​​​​​.🇶​​​​​🇨​​​​​@🇬​​​​​🇲​​​​​🇦​​​​​🇮​​​​​🇱​​​​​.🇨​​​​​🇴​​​​​🇲​​​​​
#>

New-Alias -Name pswinget -Value  Invoke-PSWinGet -Scope Global -ErrorAction Ignore -Force
New-Alias -Name wingetpath -Value  Get-WinGetExePath -Scope Global -ErrorAction Ignore -Force
New-Alias -Name wingetversion -Value  Get-WinGetVersion -Scope Global -ErrorAction Ignore -Force
New-Alias -Name getsoftdata -Value Get-InstalledSoftware -Force -ErrorAction Ignore -Description "Retrieves a list of all software installed" -Scope Global